app/views/users/index.html.erb


  <% @user.reservations.each do |reservation| %>
---
SELECT "reservations".* FROM "reservations" WHERE "reservations"."user_id" = ?  [["user_id", 3]]