app/controllers/reservations_controller.rb

  def show
    @reservation = Reservation.find(params[:id])
---
SELECT "reservations".* FROM "reservations" WHERE "reservations"."id" = ? LIMIT 1  [["id", "13"]]

  def create
    @reservation = @restaurant.reservations.build(reservation_params)
    @reservation.user_id = current_user.id
    @reservations = Reservation.all
    seats_total = @reservation.party_size



    @reservations.each do |r|
      if r.date == @reservation.date && r.restaurant_id == @reservation.restaurant_id && r.time.strftime("%H:%M") == @reservation.time.strftime("%H:%M")
        seats_total += r.party_size
      end
    end

    if @reservation.time.hour < 11 || @reservation.time.hour > 20
      redirect_to users_path, :notice => 'Sorry: the reservation must be booked between 11:00am and 8:00pm.'
    else
      if seats_total < 100
        @reservation.save
---
SELECT "reservations".* FROM "reservations"
INSERT INTO "reservations" ("created_at", "date", "party_size", "restaurant_id", "time", "updated_at", "user_id") VALUES (?, ?, ?, ?, ?, ?, ?)

  def destroy
    @reservation = Reservation.find(params[:id])
    @reservation.destroy
---
SELECT "reservations".* FROM "reservations" WHERE "reservations"."id" = ? LIMIT 1  [["id", "2"]]
DELETE FROM "reservations" WHERE "reservations"."id" = ?  [["id", 2]]

  def load_restaurant
    @restaurant = Restaurant.find(params[:restaurant_id]) if params[:restaurant_id] != nil
---
SELECT "restaurants".* FROM "restaurants" WHERE "restaurants"."id" = ? LIMIT 1  [["id", "1"]]